{
    "greet": "Hello! This is Gaya Bot How can I help you today?",
    "admission_details": "To apply for admission, you'll need a Rank Card, Allotment Cards, transcripts, and an application form.",
    "get_faculty_details": "You can find the details of the faculty in your department. Please specify the department.",
    "placement_details": "The placement cell at GVPCE provides training and placement opportunities to students. For More Details Please visit: https://www.gvpce.ac.in/campusplace.html",
    "get_results_page": "Results are available at https://www.gvpce.ac.in/result.php",
    "college_details": "",
    "college_events": "Active Events can be viewed at https://www.gvpce.ac.in",
    "college_achievements": "https://www.gvpce.ac.in/Achievements/INSTITUTIONHGHLIGHTS.pdf",
    "college_facilities": "GVPCE(A) provides various facilities like Labs, Hostel, Sports, Transport, etc. For medical-related queries visit: https://www.gvpce.ac.in/medfac.html, For Hostel related queries visit: https://www.gvpce.ac.in/hostel.html, For Transport related queries visit: https://www.gvpce.ac.in/transport.html, For labs visit: https://www.gvpce.ac.in/laboratories.html",
    "syllabus": "",
    "certificates": "For Certificate related queries Contact Administrative Office. Administrative Office is at B2",
    "contact_information": "For any queries regarding College Contact Administrative Office. For more details visit: https://gvpce.ac.in/contactus.html",
    "transfer_and_migration": "For Transfer and Migration related queries Contact Department Offices. For CSE Dept: https://gvpce.ac.in/csestaff.html, For ECE: https://gvpce.ac.in/ecestaff.html",
    "IIC": "IIC stands for Institution's Innovation Council. It is an initiative by the Ministry of Education (MoE), Government of India, established under the Innovation Cell to promote innovation, entrepreneurship, and startup culture in educational institutions. For more details visit: https://gvpce.ac.in/IIC/about.php",
    "alumni": "Alumni refers to the former students of an institution who have graduated or completed their studies. At GVPCE(A), to connect with Alumni visit: https://gvpce.almaconnect.com/",
    "internships": "GVPCE(A) encourages students to take up internships to gain practical industry experience. Internship opportunities are available through Placement Cell and Departments. For more details visit: https://www.gvpce.ac.in/campusplace.html. GVPCE(A) has a tie-up with AICTE which provides virtual Internships for the Students to gain experience in various technologies.",
    "e_mobility": "E-Mobility (Electric Mobility) refers to the use of electric vehicles (EVs), including electric cars, bikes, buses, and other battery-powered transportation, as a sustainable alternative to traditional fuel-based vehicles. For more details visit: https://gvpce.ac.in/Emobility.html",
    "apssdc": "APPSDC (Andhra Pradesh State Skill Development Corporation) is an initiative by the Government of Andhra Pradesh to enhance students' employability by providing industry-relevant skill training in various domains like AI-ML, Cloud. For more details visit: https://gvpce.ac.in/siemens.html",
    "anti_ragging": "GVPCE(A) follows a strict Anti-Ragging policy in accordance with UGC guidelines to ensure a safe and respectful environment for all students. Regarding Anti Ragging Committee members contact: https://gvpce.ac.in/committees/Anti-Ragging%20Committee%202024-2025.pdf",
    "IQAC": "IQAC (Internal Quality Assurance Cell) is a committee established at GVPCE(A) to ensure continuous academic and administrative improvement in the institution. For details visit: https://gvpce.ac.in/IQAC/",
    "CFII": "CFII (Centre for Innovation, Incubation & Industrial Collaboration) at GVPCE(A) is a dedicated hub that promotes innovation, entrepreneurship, and industry partnerships among students and faculty. It encourages startup culture and provides incubation for innovative projects.",
    "magazine": "The College Magazine at GVPCE(A) is an annual publication that showcases the talents, achievements, and creative works of students and faculty.",
    "CFSR": "More details visit: https://gvpce.ac.in/studentactivities/cfsr.php",
    "default": "Sorry, I don't understand your query. Can you please rephrase it?"
}
